<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<html lang="uk">
<head>
    <title>Home</title>
    <link rel="stylesheet" href="css/style_content.css">
</head>
<body>
    <jsp:include page="/menu.jsp" />

    <div class="paddingTop">
        <div class="content">
            <h2>Трошки історії...</h2>
            <p>Хм, то що ж то за магічне interactive fiction?</p>
            <p>Інтерактивна фантастика (ІФ) — це вид комп’ютерних ігор, у яких взаємодія з гравцем
                відбувається через текстовий інтерфейс. Розвиток цього жанру розпочався майже одночасно
                з появою комп’ютерних ігор у 1975 році, і не зупинився навіть після виходу графічних ігор.</p>
            <p>В найширшому сенсі терміна, ІФ охоплює будь-який вид художніх творів, сюжет яких не є жорстко
                фіксованим, а може змінюватись в залежності від дій читача (у комп’ютерному варіанті — користувача).
                Наприклад, популярні колись книжки-ігри з нелінійним або «гіллястим» сюжетом також є варіантом
                інтерактивної літератури.</p>
            <div class="image-container">
                <img src="image/home_page_1.jpg" alt="First image">
            </div>
        </div>
    </div>
</body>
</html>
